app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)
    if @category.save
---
INSERT INTO "categories" ("name", "price", "description", "code", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "cate01"], ["price", 100.0], ["description", "hi"], ["code", "hi"], ["created_at", "2018-06-12 02:40:23.020486"], ["updated_at", "2018-06-12 02:40:23.020486"]]

  def update
    if @category.update(category_params)
---
UPDATE "categories" SET "name" = ?, "price" = ?, "description" = ?, "code" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["name", "cate05"], ["price", 123.0], ["description", "dad"], ["code", "dad"], ["updated_at", "2018-06-12 03:32:46.793203"], ["id", 4]]